espressif/esp-idf/components/soc/esp32p4/include/soc/extmem_struct.h
/** Group: Sync Control and configuration registers */
/** Type of cache_sync_ctrl register
 *  Sync-class operation control register
 */
typedef union {
    struct {
        /** cache_invalidate_ena : R/W/SC; bitpos: [0]; default: 1;
         *  The bit is used to enable invalidate operation. It will be cleared by hardware
         *  after invalidate operation done. Note that this bit and the other sync-bits
         *  (clean_ena, writeback_ena, writeback_invalidate_ena) are mutually exclusive, that
         *  is, those bits can not be set to 1 at the same time.
         */
        uint32_t cache_invalidate_ena:1;
        /** cache_clean_ena : R/W/SC; bitpos: [1]; default: 0;
         *  The bit is used to enable clean operation. It will be cleared by hardware after
         *  clean operation done. Note that this bit and the other sync-bits (invalidate_ena,
         *  writeback_ena, writeback_invalidate_ena) are mutually exclusive, that is, those
         *  bits can not be set to 1 at the same time.
         */
        uint32_t cache_clean_ena:1;
        /** cache_writeback_ena : R/W/SC; bitpos: [2]; default: 0;
         *  The bit is used to enable writeback operation. It will be cleared by hardware after
         *  writeback operation done. Note that this bit and the other sync-bits
         *  (invalidate_ena, clean_ena, writeback_invalidate_ena) are mutually exclusive, that
         *  is, those bits can not be set to 1 at the same time.
         */
        uint32_t cache_writeback_ena:1;
        /** cache_writeback_invalidate_ena : R/W/SC; bitpos: [3]; default: 0;
         *  The bit is used to enable writeback-invalidate operation. It will be cleared by
         *  hardware after writeback-invalidate operation done. Note that this bit and the
         *  other sync-bits (invalidate_ena, clean_ena, writeback_ena) are mutually exclusive,
         *  that is, those bits can not be set to 1 at the same time.
         */
        uint32_t cache_writeback_invalidate_ena:1;
        /** cache_sync_done : RO; bitpos: [4]; default: 0;
         *  The bit is used to indicate whether sync operation (invalidate, clean, writeback,
         *  writeback_invalidate) is finished or not. 0: not finished. 1: finished.
         */
        uint32_t cache_sync_done:1;
        /** cache_sync_rgid : HRO; bitpos: [8:5]; default: 0;
         *  The bit is used to set  the gid of cache sync operation (invalidate, clean,
         *  writeback, writeback_invalidate)
         */
        uint32_t cache_sync_rgid:4;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} extmem_cache_sync_ctrl_reg_t;

/** Type of cache_sync_map register
 *  Sync map configure register
 */
typedef union {
    struct {
        /** cache_sync_map : R/W; bitpos: [5:0]; default: 63;
         *  Those bits are used to indicate which caches in the two-level cache structure will
         *  apply the sync operation.  [4]: L1-Cache
         */
        uint32_t cache_sync_map:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} extmem_cache_sync_map_reg_t;

/** Type of cache_sync_addr register
 *  Sync address configure register
 */
typedef union {
    struct {
        /** cache_sync_addr : R/W; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the sync operation,
         *  which should be used together with CACHE_SYNC_SIZE_REG
         */
        uint32_t cache_sync_addr:32;
    };
    uint32_t val;
} extmem_cache_sync_addr_reg_t;

/** Type of cache_sync_size register
 *  Sync size configure register
 */
typedef union {
    struct {
        /** cache_sync_size : R/W; bitpos: [23:0]; default: 0;
         *  Those bits are used to configure the size of the sync operation, which should be
         *  used together with CACHE_SYNC_ADDR_REG
         */
        uint32_t cache_sync_size:24;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} extmem_cache_sync_size_reg_t;


/** Group: Preload Control and configuration registers */
/** Type of l1_icache0_preload_ctrl register
 *  L1 instruction Cache 0 preload-operation control register
 */
typedef union {
    struct {
        /** l1_icache0_preload_ena : R/W/SC; bitpos: [0]; default: 0;
         *  The bit is used to enable preload operation on L1-ICache0. It will be cleared by
         *  hardware automatically after preload operation is done.
         */
        uint32_t l1_icache0_preload_ena:1;
        /** l1_icache0_preload_done : RO; bitpos: [1]; default: 1;
         *  The bit is used to indicate whether preload operation is finished or not. 0: not
         *  finished. 1: finished.
         */
        uint32_t l1_icache0_preload_done:1;
        /** l1_icache0_preload_order : HRO; bitpos: [2]; default: 0;
         *  The bit is used to configure the direction of preload operation. 0: ascending, 1:
         *  descending.
         */
        uint32_t l1_icache0_preload_order:1;
        /** l1_icache0_preload_rgid : HRO; bitpos: [6:3]; default: 0;
         *  The bit is used to set  the gid of l1 icache0 preload.
         */
        uint32_t l1_icache0_preload_rgid:4;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} extmem_l1_icache0_preload_ctrl_reg_t;

/** Type of l1_icache0_preload_addr register
 *  L1 instruction Cache 0 preload address configure register
 */
typedef union {
    struct {
        /** l1_icache0_preload_addr : HRO; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of preload on
         *  L1-ICache0, which should be used together with L1_ICACHE0_PRELOAD_SIZE_REG
         */
        uint32_t l1_icache0_preload_addr:32;
    };
    uint32_t val;
} extmem_l1_icache0_preload_addr_reg_t;

/** Type of l1_icache0_preload_size register
 *  L1 instruction Cache 0 preload size configure register
 */
typedef union {
    struct {
        /** l1_icache0_preload_size : HRO; bitpos: [13:0]; default: 0;
         *  Those bits are used to configure the size of the first section of prelock on
         *  L1-ICache0, which should be used together with L1_ICACHE0_PRELOAD_ADDR_REG
         */
        uint32_t l1_icache0_preload_size:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} extmem_l1_icache0_preload_size_reg_t;

/** Type of l1_icache1_preload_ctrl register
 *  L1 instruction Cache 1 preload-operation control register
 */
typedef union {
    struct {
        /** l1_icache1_preload_ena : R/W/SC; bitpos: [0]; default: 0;
         *  The bit is used to enable preload operation on L1-ICache1. It will be cleared by
         *  hardware automatically after preload operation is done.
         */
        uint32_t l1_icache1_preload_ena:1;
        /** l1_icache1_preload_done : RO; bitpos: [1]; default: 1;
         *  The bit is used to indicate whether preload operation is finished or not. 0: not
         *  finished. 1: finished.
         */
        uint32_t l1_icache1_preload_done:1;
        /** l1_icache1_preload_order : HRO; bitpos: [2]; default: 0;
         *  The bit is used to configure the direction of preload operation. 0: ascending, 1:
         *  descending.
         */
        uint32_t l1_icache1_preload_order:1;
        /** l1_icache1_preload_rgid : HRO; bitpos: [6:3]; default: 0;
         *  The bit is used to set  the gid of l1 icache1 preload.
         */
        uint32_t l1_icache1_preload_rgid:4;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} extmem_l1_icache1_preload_ctrl_reg_t;

/** Type of l1_icache1_preload_addr register
 *  L1 instruction Cache 1 preload address configure register
 */
typedef union {
    struct {
        /** l1_icache1_preload_addr : HRO; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of preload on
         *  L1-ICache1, which should be used together with L1_ICACHE1_PRELOAD_SIZE_REG
         */
        uint32_t l1_icache1_preload_addr:32;
    };
    uint32_t val;
} extmem_l1_icache1_preload_addr_reg_t;

/** Type of l1_icache1_preload_size register
 *  L1 instruction Cache 1 preload size configure register
 */
typedef union {
    struct {
        /** l1_icache1_preload_size : HRO; bitpos: [13:0]; default: 0;
         *  Those bits are used to configure the size of the first section of prelock on
         *  L1-ICache1, which should be used together with L1_ICACHE1_PRELOAD_ADDR_REG
         */
        uint32_t l1_icache1_preload_size:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} extmem_l1_icache1_preload_size_reg_t;

/** Type of l1_icache2_preload_ctrl register
 *  L1 instruction Cache 2 preload-operation control register
 */
typedef union {
    struct {
        /** l1_icache2_preload_ena : R/W/SC; bitpos: [0]; default: 0;
         *  The bit is used to enable preload operation on L1-ICache2. It will be cleared by
         *  hardware automatically after preload operation is done.
         */
        uint32_t l1_icache2_preload_ena:1;
        /** l1_icache2_preload_done : RO; bitpos: [1]; default: 1;
         *  The bit is used to indicate whether preload operation is finished or not. 0: not
         *  finished. 1: finished.
         */
        uint32_t l1_icache2_preload_done:1;
        /** l1_icache2_preload_order : HRO; bitpos: [2]; default: 0;
         *  The bit is used to configure the direction of preload operation. 0: ascending, 1:
         *  descending.
         */
        uint32_t l1_icache2_preload_order:1;
        /** l1_icache2_preload_rgid : HRO; bitpos: [6:3]; default: 0;
         *  The bit is used to set  the gid of l1 icache2 preload.
         */
        uint32_t l1_icache2_preload_rgid:4;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} extmem_l1_icache2_preload_ctrl_reg_t;

/** Type of l1_icache2_preload_addr register
 *  L1 instruction Cache 2 preload address configure register
 */
typedef union {
    struct {
        /** l1_icache2_preload_addr : HRO; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of preload on
         *  L1-ICache2, which should be used together with L1_ICACHE2_PRELOAD_SIZE_REG
         */
        uint32_t l1_icache2_preload_addr:32;
    };
    uint32_t val;
} extmem_l1_icache2_preload_addr_reg_t;

