espressif/esp-idf/components/soc/esp32p4/include/soc/extmem_struct.h
/** Type of l1_cache_acs_fail_int_clr register
 *  L1-Cache Access Fail Interrupt clear register
 */
typedef union {
    struct {
        /** l1_icache0_fail_int_clr : HRO; bitpos: [0]; default: 0;
         *  The bit is used to clear interrupt of access fail that occurs in L1-ICache0 due to
         *  cpu accesses L1-ICache0.
         */
        uint32_t l1_icache0_fail_int_clr:1;
        /** l1_icache1_fail_int_clr : HRO; bitpos: [1]; default: 0;
         *  The bit is used to clear interrupt of access fail that occurs in L1-ICache1 due to
         *  cpu accesses L1-ICache1.
         */
        uint32_t l1_icache1_fail_int_clr:1;
        /** l1_icache2_fail_int_clr : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_fail_int_clr:1;
        /** l1_icache3_fail_int_clr : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_fail_int_clr:1;
        /** l1_cache_fail_int_clr : WT; bitpos: [4]; default: 0;
         *  The bit is used to clear interrupt of access fail that occurs in L1-DCache due to
         *  cpu accesses L1-DCache.
         */
        uint32_t l1_cache_fail_int_clr:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} extmem_l1_cache_acs_fail_int_clr_reg_t;

/** Type of l1_cache_acs_fail_int_raw register
 *  Cache Access Fail Interrupt raw register
 */
typedef union {
    struct {
        /** l1_icache0_fail_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw bit of the interrupt of access fail that occurs in L1-ICache0.
         */
        uint32_t l1_icache0_fail_int_raw:1;
        /** l1_icache1_fail_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw bit of the interrupt of access fail that occurs in L1-ICache1.
         */
        uint32_t l1_icache1_fail_int_raw:1;
        /** l1_icache2_fail_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw bit of the interrupt of access fail that occurs in L1-ICache2.
         */
        uint32_t l1_icache2_fail_int_raw:1;
        /** l1_icache3_fail_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw bit of the interrupt of access fail that occurs in L1-ICache3.
         */
        uint32_t l1_icache3_fail_int_raw:1;
        /** l1_cache_fail_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw bit of the interrupt of access fail that occurs in L1-DCache.
         */
        uint32_t l1_cache_fail_int_raw:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} extmem_l1_cache_acs_fail_int_raw_reg_t;

/** Type of l1_cache_acs_fail_int_st register
 *  Cache Access Fail Interrupt status register
 */
typedef union {
    struct {
        /** l1_icache0_fail_int_st : HRO; bitpos: [0]; default: 0;
         *  The bit indicates the interrupt status of access fail that occurs in L1-ICache0 due
         *  to cpu accesses L1-ICache.
         */
        uint32_t l1_icache0_fail_int_st:1;
        /** l1_icache1_fail_int_st : HRO; bitpos: [1]; default: 0;
         *  The bit indicates the interrupt status of access fail that occurs in L1-ICache1 due
         *  to cpu accesses L1-ICache.
         */
        uint32_t l1_icache1_fail_int_st:1;
        /** l1_icache2_fail_int_st : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_fail_int_st:1;
        /** l1_icache3_fail_int_st : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_fail_int_st:1;
        /** l1_cache_fail_int_st : RO; bitpos: [4]; default: 0;
         *  The bit indicates the interrupt status of access fail that occurs in L1-DCache due
         *  to cpu accesses L1-DCache.
         */
        uint32_t l1_cache_fail_int_st:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} extmem_l1_cache_acs_fail_int_st_reg_t;

/** Type of l1_cache_sync_preload_int_ena register
 *  L1-Cache Access Fail Interrupt enable register
 */
typedef union {
    struct {
        /** l1_icache0_pld_done_int_ena : HRO; bitpos: [0]; default: 0;
         *  The bit is used to enable interrupt of L1-ICache0 preload-operation. If preload
         *  operation is done, interrupt occurs.
         */
        uint32_t l1_icache0_pld_done_int_ena:1;
        /** l1_icache1_pld_done_int_ena : HRO; bitpos: [1]; default: 0;
         *  The bit is used to enable interrupt of L1-ICache1 preload-operation. If preload
         *  operation is done, interrupt occurs.
         */
        uint32_t l1_icache1_pld_done_int_ena:1;
        /** l1_icache2_pld_done_int_ena : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_done_int_ena:1;
        /** l1_icache3_pld_done_int_ena : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_pld_done_int_ena:1;
        /** l1_cache_pld_done_int_ena : R/W; bitpos: [4]; default: 0;
         *  The bit is used to enable interrupt of L1-Cache preload-operation. If preload
         *  operation is done, interrupt occurs.
         */
        uint32_t l1_cache_pld_done_int_ena:1;
        uint32_t reserved_5:1;
        /** cache_sync_done_int_ena : R/W; bitpos: [6]; default: 0;
         *  The bit is used to enable interrupt of Cache sync-operation done.
         */
        uint32_t cache_sync_done_int_ena:1;
        /** l1_icache0_pld_err_int_ena : HRO; bitpos: [7]; default: 0;
         *  The bit is used to enable interrupt of L1-ICache0 preload-operation error.
         */
        uint32_t l1_icache0_pld_err_int_ena:1;
        /** l1_icache1_pld_err_int_ena : HRO; bitpos: [8]; default: 0;
         *  The bit is used to enable interrupt of L1-ICache1 preload-operation error.
         */
        uint32_t l1_icache1_pld_err_int_ena:1;
        /** l1_icache2_pld_err_int_ena : HRO; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_err_int_ena:1;
        /** l1_icache3_pld_err_int_ena : HRO; bitpos: [10]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_pld_err_int_ena:1;
        /** l1_cache_pld_err_int_ena : R/W; bitpos: [11]; default: 0;
         *  The bit is used to enable interrupt of L1-Cache preload-operation error.
         */
        uint32_t l1_cache_pld_err_int_ena:1;
        uint32_t reserved_12:1;
        /** cache_sync_err_int_ena : R/W; bitpos: [13]; default: 0;
         *  The bit is used to enable interrupt of Cache sync-operation error.
         */
        uint32_t cache_sync_err_int_ena:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} extmem_l1_cache_sync_preload_int_ena_reg_t;

/** Type of l1_cache_sync_preload_int_clr register
 *  Sync Preload operation Interrupt clear register
 */
typedef union {
    struct {
        /** l1_icache0_pld_done_int_clr : HRO; bitpos: [0]; default: 0;
         *  The bit is used to clear interrupt that occurs only when L1-ICache0
         *  preload-operation is done.
         */
        uint32_t l1_icache0_pld_done_int_clr:1;
        /** l1_icache1_pld_done_int_clr : HRO; bitpos: [1]; default: 0;
         *  The bit is used to clear interrupt that occurs only when L1-ICache1
         *  preload-operation is done.
         */
        uint32_t l1_icache1_pld_done_int_clr:1;
        /** l1_icache2_pld_done_int_clr : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_done_int_clr:1;
        /** l1_icache3_pld_done_int_clr : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_pld_done_int_clr:1;
        /** l1_cache_pld_done_int_clr : WT; bitpos: [4]; default: 0;
         *  The bit is used to clear interrupt that occurs only when L1-Cache preload-operation
         *  is done.
         */
        uint32_t l1_cache_pld_done_int_clr:1;
        uint32_t reserved_5:1;
        /** cache_sync_done_int_clr : WT; bitpos: [6]; default: 0;
         *  The bit is used to clear interrupt that occurs only when Cache sync-operation is
         *  done.
         */
        uint32_t cache_sync_done_int_clr:1;
        /** l1_icache0_pld_err_int_clr : HRO; bitpos: [7]; default: 0;
         *  The bit is used to clear interrupt of L1-ICache0 preload-operation error.
         */
        uint32_t l1_icache0_pld_err_int_clr:1;
        /** l1_icache1_pld_err_int_clr : HRO; bitpos: [8]; default: 0;
         *  The bit is used to clear interrupt of L1-ICache1 preload-operation error.
         */
        uint32_t l1_icache1_pld_err_int_clr:1;
        /** l1_icache2_pld_err_int_clr : HRO; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_err_int_clr:1;
        /** l1_icache3_pld_err_int_clr : HRO; bitpos: [10]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_pld_err_int_clr:1;
        /** l1_cache_pld_err_int_clr : WT; bitpos: [11]; default: 0;
         *  The bit is used to clear interrupt of L1-Cache preload-operation error.
         */
        uint32_t l1_cache_pld_err_int_clr:1;
        uint32_t reserved_12:1;
        /** cache_sync_err_int_clr : WT; bitpos: [13]; default: 0;
         *  The bit is used to clear interrupt of Cache sync-operation error.
         */
        uint32_t cache_sync_err_int_clr:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} extmem_l1_cache_sync_preload_int_clr_reg_t;

/** Type of l1_cache_sync_preload_int_raw register
 *  Sync Preload operation Interrupt raw register
 */
typedef union {
    struct {
        /** l1_icache0_pld_done_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw bit of the interrupt that occurs only when L1-ICache0 preload-operation is
         *  done.
         */
        uint32_t l1_icache0_pld_done_int_raw:1;
        /** l1_icache1_pld_done_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw bit of the interrupt that occurs only when L1-ICache1 preload-operation is
         *  done.
         */
        uint32_t l1_icache1_pld_done_int_raw:1;
        /** l1_icache2_pld_done_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_done_int_raw:1;
        /** l1_icache3_pld_done_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_pld_done_int_raw:1;
        /** l1_cache_pld_done_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw bit of the interrupt that occurs only when L1-Cache preload-operation is
         *  done.
         */
        uint32_t l1_cache_pld_done_int_raw:1;
        uint32_t reserved_5:1;
        /** cache_sync_done_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw bit of the interrupt that occurs only when Cache sync-operation is done.
         */
        uint32_t cache_sync_done_int_raw:1;
        /** l1_icache0_pld_err_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw bit of the interrupt that occurs only when L1-ICache0 preload-operation
         *  error occurs.
         */
        uint32_t l1_icache0_pld_err_int_raw:1;
        /** l1_icache1_pld_err_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  The raw bit of the interrupt that occurs only when L1-ICache1 preload-operation
         *  error occurs.
         */
        uint32_t l1_icache1_pld_err_int_raw:1;
        /** l1_icache2_pld_err_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_err_int_raw:1;
        /** l1_icache3_pld_err_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_pld_err_int_raw:1;
        /** l1_cache_pld_err_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  The raw bit of the interrupt that occurs only when L1-Cache preload-operation error
         *  occurs.
         */
        uint32_t l1_cache_pld_err_int_raw:1;
        uint32_t reserved_12:1;
        /** cache_sync_err_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  The raw bit of the interrupt that occurs only when Cache sync-operation error
         *  occurs.
         */
        uint32_t cache_sync_err_int_raw:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} extmem_l1_cache_sync_preload_int_raw_reg_t;

/** Type of l1_cache_sync_preload_int_st register
 *  L1-Cache Access Fail Interrupt status register
 */
typedef union {
    struct {
        /** l1_icache0_pld_done_int_st : HRO; bitpos: [0]; default: 0;
         *  The bit indicates the status of the interrupt that occurs only when L1-ICache0
         *  preload-operation is done.
         */
        uint32_t l1_icache0_pld_done_int_st:1;
        /** l1_icache1_pld_done_int_st : HRO; bitpos: [1]; default: 0;
         *  The bit indicates the status of the interrupt that occurs only when L1-ICache1
         *  preload-operation is done.
         */
        uint32_t l1_icache1_pld_done_int_st:1;
        /** l1_icache2_pld_done_int_st : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_done_int_st:1;
        /** l1_icache3_pld_done_int_st : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_pld_done_int_st:1;
        /** l1_cache_pld_done_int_st : RO; bitpos: [4]; default: 0;
         *  The bit indicates the status of the interrupt that occurs only when L1-Cache
         *  preload-operation is done.
         */
        uint32_t l1_cache_pld_done_int_st:1;
        uint32_t reserved_5:1;
        /** cache_sync_done_int_st : RO; bitpos: [6]; default: 0;
         *  The bit indicates the status of the interrupt that occurs only when Cache
         *  sync-operation is done.
         */
        uint32_t cache_sync_done_int_st:1;
        /** l1_icache0_pld_err_int_st : HRO; bitpos: [7]; default: 0;
         *  The bit indicates the status of the interrupt of L1-ICache0 preload-operation error.
         */
        uint32_t l1_icache0_pld_err_int_st:1;
        /** l1_icache1_pld_err_int_st : HRO; bitpos: [8]; default: 0;
         *  The bit indicates the status of the interrupt of L1-ICache1 preload-operation error.
         */
        uint32_t l1_icache1_pld_err_int_st:1;
        /** l1_icache2_pld_err_int_st : HRO; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_err_int_st:1;
        /** l1_icache3_pld_err_int_st : HRO; bitpos: [10]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_pld_err_int_st:1;
        /** l1_cache_pld_err_int_st : RO; bitpos: [11]; default: 0;
         *  The bit indicates the status of the interrupt of L1-Cache preload-operation error.
         */
        uint32_t l1_cache_pld_err_int_st:1;
        uint32_t reserved_12:1;
        /** cache_sync_err_int_st : RO; bitpos: [13]; default: 0;
         *  The bit indicates the status of the interrupt of Cache sync-operation error.
         */
        uint32_t cache_sync_err_int_st:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} extmem_l1_cache_sync_preload_int_st_reg_t;

