espressif/esp-idf/components/soc/esp32p4/include/soc/extmem_struct.h
typedef struct extmem_dev_s {
    volatile extmem_l1_icache_ctrl_reg_t l1_icache_ctrl;
    volatile extmem_l1_cache_ctrl_reg_t l1_cache_ctrl;
    volatile extmem_l1_bypass_cache_conf_reg_t l1_bypass_cache_conf;
    volatile extmem_l1_cache_atomic_conf_reg_t l1_cache_atomic_conf;
    volatile extmem_l1_icache_cachesize_conf_reg_t l1_icache_cachesize_conf;
    volatile extmem_l1_icache_blocksize_conf_reg_t l1_icache_blocksize_conf;
    volatile extmem_l1_cache_cachesize_conf_reg_t l1_cache_cachesize_conf;
    volatile extmem_l1_cache_blocksize_conf_reg_t l1_cache_blocksize_conf;
    volatile extmem_l1_cache_wrap_around_ctrl_reg_t l1_cache_wrap_around_ctrl;
    volatile extmem_l1_cache_tag_mem_power_ctrl_reg_t l1_cache_tag_mem_power_ctrl;
    volatile extmem_l1_cache_data_mem_power_ctrl_reg_t l1_cache_data_mem_power_ctrl;
    volatile extmem_l1_cache_freeze_ctrl_reg_t l1_cache_freeze_ctrl;
    volatile extmem_l1_cache_data_mem_acs_conf_reg_t l1_cache_data_mem_acs_conf;
    volatile extmem_l1_cache_tag_mem_acs_conf_reg_t l1_cache_tag_mem_acs_conf;
    volatile extmem_l1_icache0_prelock_conf_reg_t l1_icache0_prelock_conf;
    volatile extmem_l1_icache0_prelock_sct0_addr_reg_t l1_icache0_prelock_sct0_addr;
    volatile extmem_l1_icache0_prelock_sct1_addr_reg_t l1_icache0_prelock_sct1_addr;
    volatile extmem_l1_icache0_prelock_sct_size_reg_t l1_icache0_prelock_sct_size;
    volatile extmem_l1_icache1_prelock_conf_reg_t l1_icache1_prelock_conf;
    volatile extmem_l1_icache1_prelock_sct0_addr_reg_t l1_icache1_prelock_sct0_addr;
    volatile extmem_l1_icache1_prelock_sct1_addr_reg_t l1_icache1_prelock_sct1_addr;
    volatile extmem_l1_icache1_prelock_sct_size_reg_t l1_icache1_prelock_sct_size;
    volatile extmem_l1_icache2_prelock_conf_reg_t l1_icache2_prelock_conf;
    volatile extmem_l1_icache2_prelock_sct0_addr_reg_t l1_icache2_prelock_sct0_addr;
    volatile extmem_l1_icache2_prelock_sct1_addr_reg_t l1_icache2_prelock_sct1_addr;
    volatile extmem_l1_icache2_prelock_sct_size_reg_t l1_icache2_prelock_sct_size;
    volatile extmem_l1_icache3_prelock_conf_reg_t l1_icache3_prelock_conf;
    volatile extmem_l1_icache3_prelock_sct0_addr_reg_t l1_icache3_prelock_sct0_addr;
    volatile extmem_l1_icache3_prelock_sct1_addr_reg_t l1_icache3_prelock_sct1_addr;
    volatile extmem_l1_icache3_prelock_sct_size_reg_t l1_icache3_prelock_sct_size;
    volatile extmem_l1_cache_prelock_conf_reg_t l1_cache_prelock_conf;
    volatile extmem_l1_cache_prelock_sct0_addr_reg_t l1_cache_prelock_sct0_addr;
    volatile extmem_l1_dcache_prelock_sct1_addr_reg_t l1_dcache_prelock_sct1_addr;
    volatile extmem_l1_dcache_prelock_sct_size_reg_t l1_dcache_prelock_sct_size;
    volatile extmem_cache_lock_ctrl_reg_t cache_lock_ctrl;
    volatile extmem_cache_lock_map_reg_t cache_lock_map;
    volatile extmem_cache_lock_addr_reg_t cache_lock_addr;
    volatile extmem_cache_lock_size_reg_t cache_lock_size;
    volatile extmem_cache_sync_ctrl_reg_t cache_sync_ctrl;
    volatile extmem_cache_sync_map_reg_t cache_sync_map;
    volatile extmem_cache_sync_addr_reg_t cache_sync_addr;
    volatile extmem_cache_sync_size_reg_t cache_sync_size;
    volatile extmem_l1_icache0_preload_ctrl_reg_t l1_icache0_preload_ctrl;
    volatile extmem_l1_icache0_preload_addr_reg_t l1_icache0_preload_addr;
    volatile extmem_l1_icache0_preload_size_reg_t l1_icache0_preload_size;
    volatile extmem_l1_icache1_preload_ctrl_reg_t l1_icache1_preload_ctrl;
    volatile extmem_l1_icache1_preload_addr_reg_t l1_icache1_preload_addr;
    volatile extmem_l1_icache1_preload_size_reg_t l1_icache1_preload_size;
    volatile extmem_l1_icache2_preload_ctrl_reg_t l1_icache2_preload_ctrl;
    volatile extmem_l1_icache2_preload_addr_reg_t l1_icache2_preload_addr;
    volatile extmem_l1_icache2_preload_size_reg_t l1_icache2_preload_size;
    volatile extmem_l1_icache3_preload_ctrl_reg_t l1_icache3_preload_ctrl;
    volatile extmem_l1_icache3_preload_addr_reg_t l1_icache3_preload_addr;
    volatile extmem_l1_icache3_preload_size_reg_t l1_icache3_preload_size;
    volatile extmem_l1_cache_preload_ctrl_reg_t l1_cache_preload_ctrl;
    volatile extmem_l1_dcache_preload_addr_reg_t l1_dcache_preload_addr;
    volatile extmem_l1_dcache_preload_size_reg_t l1_dcache_preload_size;
    volatile extmem_l1_icache0_autoload_ctrl_reg_t l1_icache0_autoload_ctrl;
    volatile extmem_l1_icache0_autoload_sct0_addr_reg_t l1_icache0_autoload_sct0_addr;
    volatile extmem_l1_icache0_autoload_sct0_size_reg_t l1_icache0_autoload_sct0_size;
    volatile extmem_l1_icache0_autoload_sct1_addr_reg_t l1_icache0_autoload_sct1_addr;
    volatile extmem_l1_icache0_autoload_sct1_size_reg_t l1_icache0_autoload_sct1_size;
    volatile extmem_l1_icache1_autoload_ctrl_reg_t l1_icache1_autoload_ctrl;
    volatile extmem_l1_icache1_autoload_sct0_addr_reg_t l1_icache1_autoload_sct0_addr;
    volatile extmem_l1_icache1_autoload_sct0_size_reg_t l1_icache1_autoload_sct0_size;
    volatile extmem_l1_icache1_autoload_sct1_addr_reg_t l1_icache1_autoload_sct1_addr;
    volatile extmem_l1_icache1_autoload_sct1_size_reg_t l1_icache1_autoload_sct1_size;
    volatile extmem_l1_icache2_autoload_ctrl_reg_t l1_icache2_autoload_ctrl;
    volatile extmem_l1_icache2_autoload_sct0_addr_reg_t l1_icache2_autoload_sct0_addr;
    volatile extmem_l1_icache2_autoload_sct0_size_reg_t l1_icache2_autoload_sct0_size;
    volatile extmem_l1_icache2_autoload_sct1_addr_reg_t l1_icache2_autoload_sct1_addr;
    volatile extmem_l1_icache2_autoload_sct1_size_reg_t l1_icache2_autoload_sct1_size;
    volatile extmem_l1_icache3_autoload_ctrl_reg_t l1_icache3_autoload_ctrl;
    volatile extmem_l1_icache3_autoload_sct0_addr_reg_t l1_icache3_autoload_sct0_addr;
    volatile extmem_l1_icache3_autoload_sct0_size_reg_t l1_icache3_autoload_sct0_size;
    volatile extmem_l1_icache3_autoload_sct1_addr_reg_t l1_icache3_autoload_sct1_addr;
    volatile extmem_l1_icache3_autoload_sct1_size_reg_t l1_icache3_autoload_sct1_size;
    volatile extmem_l1_cache_autoload_ctrl_reg_t l1_cache_autoload_ctrl;
    volatile extmem_l1_cache_autoload_sct0_addr_reg_t l1_cache_autoload_sct0_addr;
    volatile extmem_l1_cache_autoload_sct0_size_reg_t l1_cache_autoload_sct0_size;
    volatile extmem_l1_cache_autoload_sct1_addr_reg_t l1_cache_autoload_sct1_addr;
    volatile extmem_l1_cache_autoload_sct1_size_reg_t l1_cache_autoload_sct1_size;
    volatile extmem_l1_cache_autoload_sct2_addr_reg_t l1_cache_autoload_sct2_addr;
    volatile extmem_l1_cache_autoload_sct2_size_reg_t l1_cache_autoload_sct2_size;
    volatile extmem_l1_cache_autoload_sct3_addr_reg_t l1_cache_autoload_sct3_addr;
    volatile extmem_l1_cache_autoload_sct3_size_reg_t l1_cache_autoload_sct3_size;
    volatile extmem_l1_cache_acs_cnt_int_ena_reg_t l1_cache_acs_cnt_int_ena;
    volatile extmem_l1_cache_acs_cnt_int_clr_reg_t l1_cache_acs_cnt_int_clr;
    volatile extmem_l1_cache_acs_cnt_int_raw_reg_t l1_cache_acs_cnt_int_raw;
    volatile extmem_l1_cache_acs_cnt_int_st_reg_t l1_cache_acs_cnt_int_st;
    volatile extmem_l1_cache_acs_fail_int_ena_reg_t l1_cache_acs_fail_int_ena;
    volatile extmem_l1_cache_acs_fail_int_clr_reg_t l1_cache_acs_fail_int_clr;
    volatile extmem_l1_cache_acs_fail_int_raw_reg_t l1_cache_acs_fail_int_raw;
    volatile extmem_l1_cache_acs_fail_int_st_reg_t l1_cache_acs_fail_int_st;
    volatile extmem_l1_cache_acs_cnt_ctrl_reg_t l1_cache_acs_cnt_ctrl;
    volatile extmem_l1_ibus0_acs_hit_cnt_reg_t l1_ibus0_acs_hit_cnt;
    volatile extmem_l1_ibus0_acs_miss_cnt_reg_t l1_ibus0_acs_miss_cnt;
    volatile extmem_l1_ibus0_acs_conflict_cnt_reg_t l1_ibus0_acs_conflict_cnt;
    volatile extmem_l1_ibus0_acs_nxtlvl_cnt_reg_t l1_ibus0_acs_nxtlvl_cnt;
    volatile extmem_l1_ibus1_acs_hit_cnt_reg_t l1_ibus1_acs_hit_cnt;
    volatile extmem_l1_ibus1_acs_miss_cnt_reg_t l1_ibus1_acs_miss_cnt;
    volatile extmem_l1_ibus1_acs_conflict_cnt_reg_t l1_ibus1_acs_conflict_cnt;
    volatile extmem_l1_ibus1_acs_nxtlvl_cnt_reg_t l1_ibus1_acs_nxtlvl_cnt;
    volatile extmem_l1_ibus2_acs_hit_cnt_reg_t l1_ibus2_acs_hit_cnt;
    volatile extmem_l1_ibus2_acs_miss_cnt_reg_t l1_ibus2_acs_miss_cnt;
    volatile extmem_l1_ibus2_acs_conflict_cnt_reg_t l1_ibus2_acs_conflict_cnt;
    volatile extmem_l1_ibus2_acs_nxtlvl_cnt_reg_t l1_ibus2_acs_nxtlvl_cnt;
    volatile extmem_l1_ibus3_acs_hit_cnt_reg_t l1_ibus3_acs_hit_cnt;
    volatile extmem_l1_ibus3_acs_miss_cnt_reg_t l1_ibus3_acs_miss_cnt;
    volatile extmem_l1_ibus3_acs_conflict_cnt_reg_t l1_ibus3_acs_conflict_cnt;
    volatile extmem_l1_ibus3_acs_nxtlvl_cnt_reg_t l1_ibus3_acs_nxtlvl_cnt;
    volatile extmem_l1_bus0_acs_hit_cnt_reg_t l1_bus0_acs_hit_cnt;
    volatile extmem_l1_bus0_acs_miss_cnt_reg_t l1_bus0_acs_miss_cnt;
    volatile extmem_l1_bus0_acs_conflict_cnt_reg_t l1_bus0_acs_conflict_cnt;
    volatile extmem_l1_bus0_acs_nxtlvl_cnt_reg_t l1_bus0_acs_nxtlvl_cnt;
    volatile extmem_l1_bus1_acs_hit_cnt_reg_t l1_bus1_acs_hit_cnt;
    volatile extmem_l1_bus1_acs_miss_cnt_reg_t l1_bus1_acs_miss_cnt;
    volatile extmem_l1_bus1_acs_conflict_cnt_reg_t l1_bus1_acs_conflict_cnt;
    volatile extmem_l1_bus1_acs_nxtlvl_cnt_reg_t l1_bus1_acs_nxtlvl_cnt;
    volatile extmem_l1_dbus2_acs_hit_cnt_reg_t l1_dbus2_acs_hit_cnt;
    volatile extmem_l1_dbus2_acs_miss_cnt_reg_t l1_dbus2_acs_miss_cnt;
    volatile extmem_l1_dbus2_acs_conflict_cnt_reg_t l1_dbus2_acs_conflict_cnt;
    volatile extmem_l1_dbus2_acs_nxtlvl_cnt_reg_t l1_dbus2_acs_nxtlvl_cnt;
    volatile extmem_l1_dbus3_acs_hit_cnt_reg_t l1_dbus3_acs_hit_cnt;
    volatile extmem_l1_dbus3_acs_miss_cnt_reg_t l1_dbus3_acs_miss_cnt;
    volatile extmem_l1_dbus3_acs_conflict_cnt_reg_t l1_dbus3_acs_conflict_cnt;
    volatile extmem_l1_dbus3_acs_nxtlvl_cnt_reg_t l1_dbus3_acs_nxtlvl_cnt;
    volatile extmem_l1_icache0_acs_fail_id_attr_reg_t l1_icache0_acs_fail_id_attr;
    volatile extmem_l1_icache0_acs_fail_addr_reg_t l1_icache0_acs_fail_addr;
    volatile extmem_l1_icache1_acs_fail_id_attr_reg_t l1_icache1_acs_fail_id_attr;
    volatile extmem_l1_icache1_acs_fail_addr_reg_t l1_icache1_acs_fail_addr;
    volatile extmem_l1_icache2_acs_fail_id_attr_reg_t l1_icache2_acs_fail_id_attr;
    volatile extmem_l1_icache2_acs_fail_addr_reg_t l1_icache2_acs_fail_addr;
    volatile extmem_l1_icache3_acs_fail_id_attr_reg_t l1_icache3_acs_fail_id_attr;
    volatile extmem_l1_icache3_acs_fail_addr_reg_t l1_icache3_acs_fail_addr;
    volatile extmem_l1_cache_acs_fail_id_attr_reg_t l1_cache_acs_fail_id_attr;
    volatile extmem_l1_dcache_acs_fail_addr_reg_t l1_dcache_acs_fail_addr;
    volatile extmem_l1_cache_sync_preload_int_ena_reg_t l1_cache_sync_preload_int_ena;
    volatile extmem_l1_cache_sync_preload_int_clr_reg_t l1_cache_sync_preload_int_clr;
    volatile extmem_l1_cache_sync_preload_int_raw_reg_t l1_cache_sync_preload_int_raw;
    volatile extmem_l1_cache_sync_preload_int_st_reg_t l1_cache_sync_preload_int_st;
    volatile extmem_l1_cache_sync_preload_exception_reg_t l1_cache_sync_preload_exception;
    volatile extmem_l1_cache_sync_rst_ctrl_reg_t l1_cache_sync_rst_ctrl;
    volatile extmem_l1_cache_preload_rst_ctrl_reg_t l1_cache_preload_rst_ctrl;
    volatile extmem_l1_cache_autoload_buf_clr_ctrl_reg_t l1_cache_autoload_buf_clr_ctrl;
    volatile extmem_l1_unallocate_buffer_clear_reg_t l1_unallocate_buffer_clear;
    volatile extmem_l1_cache_object_ctrl_reg_t l1_cache_object_ctrl;
    volatile extmem_l1_cache_way_object_reg_t l1_cache_way_object;
    volatile extmem_l1_cache_vaddr_reg_t l1_cache_vaddr;
    volatile extmem_l1_cache_debug_bus_reg_t l1_cache_debug_bus;
    volatile extmem_level_split0_reg_t level_split0;
    volatile extmem_l2_cache_ctrl_reg_t l2_cache_ctrl;
    volatile extmem_l2_bypass_cache_conf_reg_t l2_bypass_cache_conf;
    volatile extmem_l2_cache_cachesize_conf_reg_t l2_cache_cachesize_conf;
    volatile extmem_l2_cache_blocksize_conf_reg_t l2_cache_blocksize_conf;
    volatile extmem_l2_cache_wrap_around_ctrl_reg_t l2_cache_wrap_around_ctrl;
    volatile extmem_l2_cache_tag_mem_power_ctrl_reg_t l2_cache_tag_mem_power_ctrl;
    volatile extmem_l2_cache_data_mem_power_ctrl_reg_t l2_cache_data_mem_power_ctrl;
    volatile extmem_l2_cache_freeze_ctrl_reg_t l2_cache_freeze_ctrl;
    volatile extmem_l2_cache_data_mem_acs_conf_reg_t l2_cache_data_mem_acs_conf;
    volatile extmem_l2_cache_tag_mem_acs_conf_reg_t l2_cache_tag_mem_acs_conf;
    volatile extmem_l2_cache_prelock_conf_reg_t l2_cache_prelock_conf;
    volatile extmem_l2_cache_prelock_sct0_addr_reg_t l2_cache_prelock_sct0_addr;
    volatile extmem_l2_cache_prelock_sct1_addr_reg_t l2_cache_prelock_sct1_addr;
    volatile extmem_l2_cache_prelock_sct_size_reg_t l2_cache_prelock_sct_size;
    volatile extmem_l2_cache_preload_ctrl_reg_t l2_cache_preload_ctrl;
    volatile extmem_l2_cache_preload_addr_reg_t l2_cache_preload_addr;
    volatile extmem_l2_cache_preload_size_reg_t l2_cache_preload_size;
    volatile extmem_l2_cache_autoload_ctrl_reg_t l2_cache_autoload_ctrl;
    volatile extmem_l2_cache_autoload_sct0_addr_reg_t l2_cache_autoload_sct0_addr;
    volatile extmem_l2_cache_autoload_sct0_size_reg_t l2_cache_autoload_sct0_size;
    volatile extmem_l2_cache_autoload_sct1_addr_reg_t l2_cache_autoload_sct1_addr;
    volatile extmem_l2_cache_autoload_sct1_size_reg_t l2_cache_autoload_sct1_size;
    volatile extmem_l2_cache_autoload_sct2_addr_reg_t l2_cache_autoload_sct2_addr;
    volatile extmem_l2_cache_autoload_sct2_size_reg_t l2_cache_autoload_sct2_size;
    volatile extmem_l2_cache_autoload_sct3_addr_reg_t l2_cache_autoload_sct3_addr;
    volatile extmem_l2_cache_autoload_sct3_size_reg_t l2_cache_autoload_sct3_size;
    volatile extmem_l2_cache_acs_cnt_int_ena_reg_t l2_cache_acs_cnt_int_ena;
    volatile extmem_l2_cache_acs_cnt_int_clr_reg_t l2_cache_acs_cnt_int_clr;
    volatile extmem_l2_cache_acs_cnt_int_raw_reg_t l2_cache_acs_cnt_int_raw;
    volatile extmem_l2_cache_acs_cnt_int_st_reg_t l2_cache_acs_cnt_int_st;
    volatile extmem_l2_cache_acs_fail_int_ena_reg_t l2_cache_acs_fail_int_ena;
    volatile extmem_l2_cache_acs_fail_int_clr_reg_t l2_cache_acs_fail_int_clr;
    volatile extmem_l2_cache_acs_fail_int_raw_reg_t l2_cache_acs_fail_int_raw;
    volatile extmem_l2_cache_acs_fail_int_st_reg_t l2_cache_acs_fail_int_st;
    volatile extmem_l2_cache_acs_cnt_ctrl_reg_t l2_cache_acs_cnt_ctrl;
    volatile extmem_l2_ibus0_acs_hit_cnt_reg_t l2_ibus0_acs_hit_cnt;
    volatile extmem_l2_ibus0_acs_miss_cnt_reg_t l2_ibus0_acs_miss_cnt;
    volatile extmem_l2_ibus0_acs_conflict_cnt_reg_t l2_ibus0_acs_conflict_cnt;
    volatile extmem_l2_ibus0_acs_nxtlvl_cnt_reg_t l2_ibus0_acs_nxtlvl_cnt;
    volatile extmem_l2_ibus1_acs_hit_cnt_reg_t l2_ibus1_acs_hit_cnt;
    volatile extmem_l2_ibus1_acs_miss_cnt_reg_t l2_ibus1_acs_miss_cnt;
    volatile extmem_l2_ibus1_acs_conflict_cnt_reg_t l2_ibus1_acs_conflict_cnt;
    volatile extmem_l2_ibus1_acs_nxtlvl_cnt_reg_t l2_ibus1_acs_nxtlvl_cnt;
    volatile extmem_l2_ibus2_acs_hit_cnt_reg_t l2_ibus2_acs_hit_cnt;
    volatile extmem_l2_ibus2_acs_miss_cnt_reg_t l2_ibus2_acs_miss_cnt;
    volatile extmem_l2_ibus2_acs_conflict_cnt_reg_t l2_ibus2_acs_conflict_cnt;
    volatile extmem_l2_ibus2_acs_nxtlvl_cnt_reg_t l2_ibus2_acs_nxtlvl_cnt;
    volatile extmem_l2_ibus3_acs_hit_cnt_reg_t l2_ibus3_acs_hit_cnt;
    volatile extmem_l2_ibus3_acs_miss_cnt_reg_t l2_ibus3_acs_miss_cnt;
    volatile extmem_l2_ibus3_acs_conflict_cnt_reg_t l2_ibus3_acs_conflict_cnt;
    volatile extmem_l2_ibus3_acs_nxtlvl_cnt_reg_t l2_ibus3_acs_nxtlvl_cnt;
    volatile extmem_l2_dbus0_acs_hit_cnt_reg_t l2_dbus0_acs_hit_cnt;
    volatile extmem_l2_dbus0_acs_miss_cnt_reg_t l2_dbus0_acs_miss_cnt;
    volatile extmem_l2_dbus0_acs_conflict_cnt_reg_t l2_dbus0_acs_conflict_cnt;
    volatile extmem_l2_dbus0_acs_nxtlvl_cnt_reg_t l2_dbus0_acs_nxtlvl_cnt;
    volatile extmem_l2_dbus1_acs_hit_cnt_reg_t l2_dbus1_acs_hit_cnt;
    volatile extmem_l2_dbus1_acs_miss_cnt_reg_t l2_dbus1_acs_miss_cnt;
    volatile extmem_l2_dbus1_acs_conflict_cnt_reg_t l2_dbus1_acs_conflict_cnt;
    volatile extmem_l2_dbus1_acs_nxtlvl_cnt_reg_t l2_dbus1_acs_nxtlvl_cnt;
    volatile extmem_l2_dbus2_acs_hit_cnt_reg_t l2_dbus2_acs_hit_cnt;
    volatile extmem_l2_dbus2_acs_miss_cnt_reg_t l2_dbus2_acs_miss_cnt;
    volatile extmem_l2_dbus2_acs_conflict_cnt_reg_t l2_dbus2_acs_conflict_cnt;
    volatile extmem_l2_dbus2_acs_nxtlvl_cnt_reg_t l2_dbus2_acs_nxtlvl_cnt;
    volatile extmem_l2_dbus3_acs_hit_cnt_reg_t l2_dbus3_acs_hit_cnt;
    volatile extmem_l2_dbus3_acs_miss_cnt_reg_t l2_dbus3_acs_miss_cnt;
    volatile extmem_l2_dbus3_acs_conflict_cnt_reg_t l2_dbus3_acs_conflict_cnt;
    volatile extmem_l2_dbus3_acs_nxtlvl_cnt_reg_t l2_dbus3_acs_nxtlvl_cnt;
    volatile extmem_l2_cache_acs_fail_id_attr_reg_t l2_cache_acs_fail_id_attr;
    volatile extmem_l2_cache_acs_fail_addr_reg_t l2_cache_acs_fail_addr;
    volatile extmem_l2_cache_sync_preload_int_ena_reg_t l2_cache_sync_preload_int_ena;
    volatile extmem_l2_cache_sync_preload_int_clr_reg_t l2_cache_sync_preload_int_clr;
    volatile extmem_l2_cache_sync_preload_int_raw_reg_t l2_cache_sync_preload_int_raw;
    volatile extmem_l2_cache_sync_preload_int_st_reg_t l2_cache_sync_preload_int_st;
    volatile extmem_l2_cache_sync_preload_exception_reg_t l2_cache_sync_preload_exception;
    volatile extmem_l2_cache_sync_rst_ctrl_reg_t l2_cache_sync_rst_ctrl;
    volatile extmem_l2_cache_preload_rst_ctrl_reg_t l2_cache_preload_rst_ctrl;
    volatile extmem_l2_cache_autoload_buf_clr_ctrl_reg_t l2_cache_autoload_buf_clr_ctrl;
    volatile extmem_l2_unallocate_buffer_clear_reg_t l2_unallocate_buffer_clear;
    volatile extmem_l2_cache_access_attr_ctrl_reg_t l2_cache_access_attr_ctrl;
    volatile extmem_l2_cache_object_ctrl_reg_t l2_cache_object_ctrl;
    volatile extmem_l2_cache_way_object_reg_t l2_cache_way_object;
    volatile extmem_l2_cache_vaddr_reg_t l2_cache_vaddr;
    volatile extmem_l2_cache_debug_bus_reg_t l2_cache_debug_bus;
    volatile extmem_level_split1_reg_t level_split1;
    volatile extmem_clock_gate_reg_t clock_gate;
    volatile extmem_redundancy_sig0_reg_t redundancy_sig0;
    volatile extmem_redundancy_sig1_reg_t redundancy_sig1;
    volatile extmem_redundancy_sig2_reg_t redundancy_sig2;
    volatile extmem_redundancy_sig3_reg_t redundancy_sig3;
    volatile extmem_redundancy_sig4_reg_t redundancy_sig4;
    uint32_t reserved_3c4[14];
    volatile extmem_date_reg_t date;
} extmem_dev_t;

extern extmem_dev_t EXTMEM;

#ifndef __cplusplus
_Static_assert(sizeof(extmem_dev_t) == 0x400, "Invalid size of extmem_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
